app/Controllers/Home.php

    public function index()
    {
        $artikel = $this->artikelModel->getArtikel()->orderBy('id_artikel', 'DESC')->limit(3)->find();
---
SELECT *, `artikel`.`created_at` AS `tanggal`
FROM `artikel`
JOIN `users` ON `artikel`.`id_penulis` = `users`.`id`
ORDER BY `id_artikel` DESC
 LIMIT 3